mcskny/wireless-he-macropad/Firmware/dongle-receiver/sdkconfig.defaults
# ESP32-S3 Dongle (Xiao ESP32-S3) - sdkconfig defaults
# Hedef: ESP32-S3, ESP-IDF v6.0.x
#
# S3 dongle: USB HID composite (NKRO + Consumer + Gamepad), ESP-NOW RX,
# Wi-Fi AP (config mode), WebSocket server.
#
# Log: UART0 (GPIO43/44) - TinyUSB USB-OTG aktif oldugunda USB-Serial/JTAG
# kullanilamaz. Harici USB-TTL adapter ile log alinir.

# --- Hedef chip ---
CONFIG_IDF_TARGET="esp32s3"

# --- Console / Log ---
# UART0 console (GPIO43=TX, GPIO44=RX). TinyUSB USB-OTG ile cakismaz.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM_0=y
CONFIG_ESP_CONSOLE_UART_TX_GPIO=43
CONFIG_ESP_CONSOLE_UART_RX_GPIO=44

# --- NVS ---
CONFIG_NVS_ENABLED=y
CONFIG_NVS_ENCRYPTION=n

# --- Partition table ---
# Single factory app + NVS. TinyUSB descriptor + Wi-Fi AP icin yeterli.
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# --- Wi-Fi (ESP-NOW RX + AP mode) ---
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n  # S3 dongle USB powered, sleep gerekmez

# --- Stack sizes ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192  # WebSocket + USB daha fazla stack

# --- PSRAM (Xiao ESP32-S3 S3R8: 8MB PSRAM) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# --- USB-OTG (S3'te var, TinyUSB icin) ---
# TinyUSB HID class aktif (NKRO klavye + Consumer + Gamepad icin)
CONFIG_TINYUSB_HID_COUNT=1

# --- HTTP Server WebSocket (CONFIG_AP_MODE kalibrasyon icin) ---
CONFIG_HTTPD_WS_SUPPORT=y
